app/models/event.rb

SELECT COUNT(*) FROM "events" WHERE "events"."event_venue_id" = ? AND "events"."start_date" = ?  [["event_venue_id", 1], ["start_date", "2019-03-01"]]
---
  def date_validator
    errors.add(:start_date, "Must be greater than current date") if
        start_date<Date.today
    errors.add("This event can't be today because there is another in the same venue at the same date") if
        Event.where(event_venue_id: event_venue_id, start_date: start_date).count()>0