app/models/ticket.rb

  def Date_validation
    event_start_date = Event.find(TicketType.find(ticket_type_id).event_id).start_date
    if Order.find(order_id).created_at>event_start_date
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]